/*
 * Copyright (C) 2019 SuperH, Inc. All Rights Reserved.
 */
package com.cloud.clientservice.myTest;

import java.io.BufferedReader;
import java.io.BufferedWriter;
import java.io.File;
import java.io.FileOutputStream;
import java.io.FileReader;
import java.io.IOException;
import java.io.InputStream;
import java.io.OutputStreamWriter;
import java.lang.reflect.Field;
import java.lang.reflect.Method;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.function.Predicate;

import org.apache.commons.lang3.ObjectUtils;
import org.junit.Test;
import org.springframework.util.CollectionUtils;
import org.yaml.snakeyaml.Yaml;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONObject;
import com.alibaba.fastjson.TypeReference;
import com.cloud.pojo.entities.Demo;
import com.cloud.pojo.vo.SSD1_ADVAN_AGE_DISTRI;
import com.cloud.pojo.vo.SSD1_FirstVo;
import com.cloud.pojo.vo.SSD1_INPUT;
import com.cloud.pojo.vo.SSD1_SecondVo;
import com.cloud.pojo.vo.SSD2_FirstVo;
import com.cloud.pojo.vo.SSD2_UNMODEL_INDEX_CONTENT;
import com.cloud.pojo.vo.SSD2_UNMODEL_INDEX_INPUT;
import com.esotericsoftware.yamlbeans.YamlReader;
import com.google.gson.Gson;
import com.google.gson.JsonArray;
import com.google.gson.JsonElement;
import com.google.gson.internal.LinkedTreeMap;

/**
 * @authur wtj
 * @date 2019/6/24    15:04
 */
public class MyTest {


//    @Test
//    public void testRealm() {
//        // 加载配置文件生成工厂
//        Factory<SecurityManager> securityManagerFactory = new IniSecurityManagerFactory(
//                "classpath:ini/shiro_realm.ini");
//        //获得安全管理器
//        SecurityManager securityManager = securityManagerFactory.getInstance();
//        //交给shiro环境
//        SecurityUtils.setSecurityManager(1securityManager);
//        //获得主体验证
//        Subject subject = SecurityUtils.getSubject();
//
//        //创建token
//        UsernamePasswordToken token = new  UsernamePasswordToken("wtj", "123");
//
//
//        //认证
//        try {
//            subject.login(token);
//        } catch (Exception e) {
//            // TODO Auto-generated catch block
//            e.printStackTrace();
//        }
//        System.out.println("认证成功:"+subject.isAuthenticated());
//    }

    @Test
    public  void testJosnToMap(){
        String s = "{{\"0\":\"zhangsan\",\"1\":\"lisi\",\"2\":\"wangwu\",\"3\":\"maliu\"}," +
                "{\"00\":\"zhangsan\",\"11\":\"lisi\",\"22\":\"wangwu\",\"33\":\"maliu\"}}";
        String str1 = "{\"0\":\"zhangsan\",\"1\":\"lisi\",\"2\":\"wangwu\",\"3\":\"maliu\"}";
        String str = "{\n"
                + "    \"msg\":\"查询成功\",\n"
                + "    \"code\":\"0\",\n"
                + "    \"content\":{\n"
                + "        \"LAWINFO\":[\n"
                + "            {\n"
                + "                \"SERILLREA\":\"提交虚假材料或者采取其他欺诈手段隐瞒重要事实，取得公司变更或者注销登记，被撤销登记的\",\n"
                + "                \"REMDATE\":\"—\",\n"
                + "                \"REMEXCPRES\":\"—\",\n"
                + "                \"DECORG\":\"海州区市场监督管理局\",\n"
                + "                \"ABNTIME\":\"2017-08-02\"\n"
                + "            }\n"
                + "        ],\n"
                + "        \"ALL\":{\n"
                + "            \"ajlcCount\":\"0\",\n"
                + "            \"zxggCount\":\"0\",\n"
                + "            \"wdhmdCount\":\"0\",\n"
                + "            \"fyggCount\":\"0\",\n"
                + "            \"cpwsCount\":\"0\",\n"
                + "            \"ktggCount\":\"0\",\n"
                + "            \"totalCount\":\"0\",\n"
                + "            \"sxggCount\":\"0\"\n"
                + "        }}}";
        //第一种方式
        Map maps = (Map) JSON.parse(str);
        System.out.println("这个是用JSON类来解析JSON字符串!!!");
        for (Object map : maps.entrySet()){
            System.out.println(((Map.Entry)map).getKey()+"     " + ((Map.Entry)map).getValue());
        }
        //第二种方式
        Map mapTypes = JSON.parseObject(str);
        System.out.println("这个是用JSON类的parseObject来解析JSON字符串!!!");
        for (Object obj : mapTypes.keySet()){
            System.out.println("key为："+obj+"值为："+mapTypes.get(obj));
        }
        //第三种方式
        Map mapType = JSON.parseObject(str,Map.class);
        System.out.println("这个是用JSON类,指定解析类型，来解析JSON字符串!!!");
        for (Object obj : mapType.keySet()){
            System.out.println("key为："+obj+"值为："+mapType.get(obj));
        }
        //第四种方式
        /**
         * JSONObject是Map接口的一个实现类
         */
        Map json = (Map) JSONObject.parse(str);
        System.out.println("这个是用JSONObject类的parse方法来解析JSON字符串!!!");
        for (Object map : json.entrySet()){
            System.out.println(((Map.Entry)map).getKey()+"  "+((Map.Entry)map).getValue());
        }
        //第五种方式
        /**
         * JSONObject是Map接口的一个实现类
         */
        JSONObject jsonObject = JSONObject.parseObject(str);
        System.out.println("这个是用JSONObject的parseObject方法来解析JSON字符串!!!");
        for (Object map : json.entrySet()){
            System.out.println(((Map.Entry)map).getKey()+"  "+((Map.Entry)map).getValue());
        }
        //第六种方式
        /**
         * JSONObject是Map接口的一个实现类
         */
        Map mapObj = JSONObject.parseObject(str,Map.class);
        System.out.println("这个是用JSONObject的parseObject方法并执行返回类型来解析JSON字符串!!!");
        for (Object map: json.entrySet()){
            System.out.println(((Map.Entry)map).getKey()+"  "+((Map.Entry)map).getValue());
        }
        String strArr = "{{\"0\":\"zhangsan\",\"1\":\"lisi\",\"2\":\"wangwu\",\"3\":\"maliu\"}," +
                "{\"00\":\"zhangsan\",\"11\":\"lisi\",\"22\":\"wangwu\",\"33\":\"maliu\"}}";
        // JSONArray.parse()
        System.out.println(json);
    }

    /**
     * 读取txt文件的内容
     * @param
     * @return 返回文件内容
     */


    @Test
    public  void txt(){
        File file = new File("D:/errlog.txt");
        StringBuilder result = new StringBuilder();
        try{
            BufferedReader br = new BufferedReader(new FileReader(file));//构造一个BufferedReader类来读取文件
            String s = null;
            while((s = br.readLine())!=null){//使用readLine方法，一次读一行
                result.append(System.lineSeparator()+s);
            }
            br.close();
        }catch(Exception e){
            e.printStackTrace();
        }

        System.out.println(result.toString());
    }
    @Test
    public  void roleTest(){
        String s = "哈哈";
        System.out.println(s.getBytes().length);

        Map<String,String> map = new HashMap();
        map.put("jj",null);
        SSD1_ADVAN_AGE_DISTRI ssd = new SSD1_ADVAN_AGE_DISTRI();
        map.put("ee",ssd.getENTNAME());

        SSD1_INPUT input = new SSD1_INPUT();


      /*  input.setSYSTEM_USER_AUTH();
        input.setEMP_NO();
        input.setQUERY_REASON();
        input.setCREDIT_CODE();
        input.setNSR_ID();*/

      /*  SSD1_LAWINFO role = new SSD1_LAWINFO();
      role.setABNTIME("1");
      role.setDECORG("2");
        role.setENTNAME("3");
        role.setOPDATE("4");
        role.setQUERY_SYS("5");
        role.setREMEXCPRES("6");
        role.setSERILLREA("7");
        role.setSID("8");
        role.setSRC_SEQ_NUM("9");
        role.setQUERY_SYS("10");



        String data="";

        System.out.println(role.toString());*/
    }
    @Test
    public  void roleTest3(){
        String data ="{\"errNum\":0,\"errMsg\":\"success\",\"timeStamps\":1557373683027,"
                + "\"retData\":{\"top10sp_ratio_in3month\":\"19.260399626236136\",\"sptype_count_in6month\":\"1\","
                + "\"cus_incr_new6\":\"0\",\"cus_incr_new3\":\"0\",\"yzxzs\":\"0.759621942583937\","
                + "\"nearlynmons_ent_amount_aratio12\":\"0.8908498506652286\",\"cus_loss_ratio6\":\"1.0\","
                + "\"top1sp_ratio_in3month\":\"19.260399626236136\",\"cus_loss_ratio3\":\"1.0\",\"cus_person_times3\":\"0\","
                + "\"cus_person_times6\":\"0\",\"nearlynmons_ent_amount_aratio3\":\"0.8831725616291506\","
                + "\"nearlynmons_ent_newincr_aratio3\":\"0.0\",\"nearlynmons_ent_newincr_aratio6\":\"0.0\","
                + "\"qy_credit_change\":\"下滑\",\"cus_person_times12\":\"0\",\"nearlynmons_ent_amount_aratio6\":\"0"
                + ".89592274678112\",\"top3sp_ratio_in6month\":\"19.239822370662406\",\"cus_yoy_incr_kh6\":\"0.0\","
                + "\"top3sp_ratio_in3month\":\"19.260399626236136\",\"nearlynmons_ent_aratio6\":\"0.9230769230769231\","
                + "\"cus_trade_active_ratio6\":\"5.6923076923076925\",\"nearlynmons_ent_aratio3\":\"0.9230769230769231\","
                + "\"cus_trade_active_ratio3\":\"2.8461538461538463\",\"nearlynmons_ent_newincr_aratio12\":\"0.0\","
                + "\"cus_yoy_incr_kh3\":\"0.0\",\"sptype_count_in12month\":\"1\",\"top10sp_ratio_in6month\":\"19"
                + ".239822370662406\",\"old_customer_ratio6\":\"1.0\",\"old_customer_ratio3\":\"1.0\","
                + "\"nearlynmons_ent_aratio12\":\"0.9230769230769231\",\"qy_credit_last2year\":\"A\","
                + "\"qy_credit_lastyear\":\"\",\"consistency_dq\":\"0.23076923076923078\",\"consistency_hy\":\"0.0\","
                + "\"cus_trade_active_ratio12\":\"11.538461538461538\",\"top1sp_ratio_in6month\":\"19.239822370662406\","
                + "\"sptype_count_in3month\":\"1\",\"top10sp_overlapratio_in3month_lastyear\":\"1.0\","
                + "\"top10sp_overlapratio_in6month\":\"1.0\",\"grkhfpzb\":\"0.0\",\"top10sp_overlapratio_in3month\":\"1.0\","
                + "\"hhi\":\"0.8639695900081458\",\"count_customer_downstream12\":\"13\",\"old_customer_ratio12\":\"1.0\","
                + "\"zdkpjg\":\"2.0\",\"cus_yoy_incr_people6\":\"-1.0\",\"cus_yoy_incr_kh12\":\"0.0\","
                + "\"cus_loss_ratio12\":\"1.0\",\"cus_yoy_incr_people3\":\"-1.0\",\"count_customer_downstream3\":\"13\","
                + "\"count_customer_downstream6\":\"13\"}}";
        Map<String,String > map = new HashMap();
        String etlDate ="201905161";
        writeData1(data,map,etlDate);


    }

    private void writeData1(String data, Map<String, String> map, String etlDate) {
        try {
            SSD2_FirstVo firstVo = JSON.parseObject(data, new TypeReference<SSD2_FirstVo>() {});
            // 状态正常，并有数据
            if ("0".equals(firstVo.getErrNum() )) {

                SSD2_UNMODEL_INDEX_CONTENT content =  firstVo.getRetData();

                SSD2_UNMODEL_INDEX_INPUT input = new SSD2_UNMODEL_INDEX_INPUT();
                input.setSYSTEM_USER_AUTH("SYSTEM_USER_AUTH");
                input.setEMP_NO("EMP_NO");
                input.setQUERY_REASON("QUERY_REASON");
                input.setCREDIT_CODE("CREDIT_CODE");
                input.setNSR_ID("NSR_ID");



                writeObjectToFile(content,  map,etlDate);
                writeObjectToFile(input,  map,etlDate);




            }
        } catch (Exception e) {
            e.printStackTrace();
        }
    }

    @Test
    public  void roleTest2(){
        String data = "{\"msg\":\"查询成功\",\"code\":\"0\","
                + "\"content\":{\"LAWINFO\":[{\"SERILLREA\":\"提交虚假材料或者采取其他欺诈手段隐瞒重要事实，取得公司变更或者注销登记，被撤销登记的\","
                + "\"REMDATE\":\"—\",\"REMEXCPRES\":\"—\",\"DECORG\":\"海州区市场监督管理局\",\"ABNTIME\":\"2017-08-02\"}],"
                + "\"ALL\":{\"ajlcCount\":\"0\",\"zxggCount\":\"0\",\"wdhmdCount\":\"0\",\"fyggCount\":\"0\","
                + "\"cpwsCount\":\"0\",\"ktggCount\":\"0\",\"totalCount\":\"0\",\"sxggCount\":\"0\"},"
                + "\"SYLXFB\":[{\"qylx_mc\":\"有限责任公司\",\"zb\":\"100.000\",\"je\":\"37760684.40\"}],"
                + "\"QSXX\":[{\"OW_REMAIN\":\"-\",\"PUB_DATE\":\"2017-10-20\",\"TAX_AUTHORITY\":\"北京市地方税务局\","
                + "\"TYPE\":\"消费税\",\"NSRSBH\":\"L******\",\"OW_AMOUNT\":\"250\"}],\"FYBNSR\":[],\"FREEZEINFO\":[],"
                + "\"RQZC\":[],\"ZYSPFX\":{\"zysp_jnxs\":\"0.0\",\"fpxxVo\":{\"fp_qdxx_sum_rate\":\"100.00\","
                + "\"fp_sum\":\"0.00\",\"fp_qdxx_sum\":\"38705439.60\",\"fp_qdxx_count\":\"3933\",\"fp_count\":\"0\","
                + "\"fp_sum_rate\":\"0.00\"},\"jzd\":\"不予评价\",\"xx_sl\":\"1\",\"xx_spqd\":[{\"xh\":\"3.0\","
                + "\"cs\":\"19665\",\"dw\":\"吨\",\"mc\":\"钢材\",\"zb\":\"100.000\",\"je\":\"743887620.00\"}],"
                + "\"cjqj\":\"2017年05月-2018年08月\"},\"QSDSYQY\":{\"sysdqy\":[{\"pjnd\":\"2017\","
                + "\"zhjyrq\":\"2018-08-15\",\"fpfs\":\"567\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\","
                + "\"qymc\":\"60B83C1587499BF4B36EAF7722A32647\",\"nsxydj\":\"A\",\"hy\":\"商务服务\","
                + "\"nsrsbh\":\"9**********Y\",\"jebl\":\"14.777\",\"dy\":\"重庆市重庆市县忠县\",\"jyje\":\"5579960.40\","
                + "\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-11\",\"fpfs\":\"543\","
                + "\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"3D2F04344B57D95A7C598A1AB15C3274\","
                + "\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********E\",\"jebl\":\"14.152\","
                + "\"dy\":\"浙江省宁波市\",\"jyje\":\"5343771.60\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\","
                + "\"zhjyrq\":\"2018-08-16\",\"fpfs\":\"518\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\","
                + "\"qymc\":\"C57BBE7FCB9F6EB6D25EC0FD84F808A0\",\"nsxydj\":\"A\",\"hy\":\"商务服务\","
                + "\"nsrsbh\":\"9**********C\",\"jebl\":\"13.500\",\"dy\":\"重庆市\",\"jyje\":\"5097741.60\","
                + "\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-10\",\"fpfs\":\"511\","
                + "\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"52DB4D2C16991BA87663E7C1E3ACD8FF\","
                + "\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********Y\",\"jebl\":\"13.318\","
                + "\"dy\":\"重庆市重庆市辖区綦江区\",\"jyje\":\"5028853.20\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\","
                + "\"zhjyrq\":\"2018-08-11\",\"fpfs\":\"504\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\","
                + "\"qymc\":\"3A83D5695755049EA95749ECF88928E2\",\"nsxydj\":\"A\",\"hy\":\"商务服务\","
                + "\"nsrsbh\":\"9**********G\",\"jebl\":\"13.135\",\"dy\":\"重庆市重庆市县奉节县\",\"jyje\":\"4959964.80\","
                + "\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-12\",\"fpfs\":\"480\","
                + "\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"75509B38CB84AC5505691DD4EFF2FB3F\","
                + "\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********F\",\"jebl\":\"12.510\","
                + "\"dy\":\"内蒙古自治区呼和浩特市\",\"jyje\":\"4723776.00\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\","
                + "\"zhjyrq\":\"2018-08-17\",\"fpfs\":\"464\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\","
                + "\"qymc\":\"2A98FD82778112D57DE45DD29DE1DEAE\",\"nsxydj\":\"A\",\"hy\":\"商务服务\","
                + "\"nsrsbh\":\"9**********9\",\"jebl\":\"12.093\",\"dy\":\"浙江省宁波市宁海县\",\"jyje\":\"4566316.80\","
                + "\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-01\",\"fpfs\":\"139\","
                + "\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"F4A033BE3A365966BD78AF030350BA33\","
                + "\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********5\",\"jebl\":\"3.623\","
                + "\"dy\":\"内蒙古自治区呼和浩特市\",\"jyje\":\"1367926.80\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\","
                + "\"zhjyrq\":\"2018-06-29\",\"fpfs\":\"86\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\","
                + "\"qymc\":\"6DD1F4F82C697FB46F67E089DB2C1FA2\",\"nsxydj\":\"A\",\"hy\":\"商务服务\","
                + "\"nsrsbh\":\"9**********B\",\"jebl\":\"2.241\",\"dy\":\"浙江省宁波市\",\"jyje\":\"846343.20\","
                + "\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-06-28\",\"fpfs\":\"25\","
                + "\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"D3225B38ABFA8F87EAFC0F8FB068F183\","
                + "\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********9\",\"jebl\":\"0.652\",\"dy\":\"浙江省宁波市\","
                + "\"jyje\":\"246030.00\",\"zcsj\":\"1999-09-09\"}],\"cjqj\":\"2017年05月-2018年08月\","
                + "\"syqytj\":{\"syjzd\":\"低\",\"qysl\":\"10\",\"averageJe\":\"3776068.44\",\"sumJe\":\"37760684"
                + ".40\",\"syjnxs\":\"0.26\"}},\"CPWS\":[],\"CHGINFO\":[{\"ALTDATE\":\"2018-07-16\","
                + "\"ALTAF"
                +
                "\":\"开发、销售计算机网络应用软件；设计、制作、加工计算机网络产品并提供相关技术服务和咨询服务；服务：自有物业租赁，翻译，成年人的非证书劳动职业技能培训（涉及许可证的除外）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）\",\"ALTITEM\":\"经营范围变更\",\"ALTBE\":\"开发、销售计算机网络应用软件；设计、制作、加工计算机网络产品并提供相关技术服务和咨询服务；服务：自有物业租赁，翻译，成年人的非证书劳动职业技能培训，成年人的非文化教育培训（涉及许可证的除外）。\"},{\"ALTDATE\":\"2018-07-16\",\"ALTAF\":\"现联络员姓名:武卫;现联络员固定电话:;现联络员移动电话:*********** ;现联络员电子邮箱:;现联络员身份证件类型:中华人民共和国居民身份证;现联络人员证件号码:******************;现财务负责人姓名:李博;现财务负责人固定电话:;现财务负责人移动电话:************;现财务负责人电子邮箱:;现财务负责人证件名称:中华人民共和国居民身份证;现财务负责人身份证件号码:****************** \",\"ALTITEM\":\"企业联络人员、财务人员\",\"ALTBE\":\"原联络员姓名:武卫;原联络员固定电话:;原联络员移动电话:*********** ;原联络员电子邮箱:;原联络员身份证件类型:中华人民共和国居民身份证;原联络人员证件号码:******************;原财务负责人姓名:黄融;原财务负责人固定电话:****-********;原财务负责人移动电话:***********;原财务负责人电子邮箱:joe.*****;原财务负责人证件名称:中华人民共和国居民身份证;原财务负责人身份证件号码:****************** \"},{\"ALTDATE\":\"2018-07-16\",\"ALTAF\":\"戴珊\",\"ALTITEM\":\"法定代表人变更\",\"ALTBE\":\"张勇\"},{\"ALTDATE\":\"2018-07-16\",\"ALTAF\":\"姓名: 冯云乐; 证件号码: ******************; 职位: 监事姓名: 张彧; 证件号码: ******************; 职位: 董事姓名: 戴珊; 证件号码: ******************; 职位: 董事长兼总经理姓名: 蒋芳; 证件号码: ******************; 职位: 董事\",\"ALTITEM\":\"高级管理人员备案\",\"ALTBE\":\"姓名: 张勇; 证件号码: ******************; 职位: 董事长兼总经理姓名: 武卫; 证件号码: ******************; 职位: 董事姓名: 蒋芳; 证件号码: ******************; 职位: 董事姓名: 郑俊芳; 证件号码: ******************; 职位: 监事\"},{\"ALTDATE\":\"2017-06-16\",\"ALTAF\":\"企业名称: Alibaba.com China Limited; 出资额: *****万; 百分比: ***%\",\"ALTITEM\":\"投资人(股权)变更\",\"ALTBE\":\"企业名称: Alibaba.com China Limited; 出资额: *****万; 百分比: ***%\"}],\"JXFPSJTJ\":[{\"yxppje\":\"—\",\"gfkpyf\":\"201904\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201903\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201902\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201901\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201812\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201811\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201810\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"—\",\"gfkpyf\":\"201809\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201808\",\"jxfps\":\"152\",\"yxzpfps\":\"152\",\"jxje\":\"1495862.40\",\"yxppfps\":\"0\",\"yxzpje\":\"1495862.40\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201807\",\"jxfps\":\"242\",\"yxzpfps\":\"242\",\"jxje\":\"2381570.40\",\"yxppfps\":\"0\",\"yxzpje\":\"2381570.40\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201806\",\"jxfps\":\"251\",\"yxzpfps\":\"251\",\"jxje\":\"2470141.20\",\"yxppfps\":\"0\",\"yxzpje\":\"2470141.20\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201805\",\"jxfps\":\"257\",\"yxzpfps\":\"257\",\"jxje\":\"2529188.40\",\"yxppfps\":\"0\",\"yxzpje\":\"2529188.40\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201804\",\"jxfps\":\"255\",\"yxzpfps\":\"255\",\"jxje\":\"2509506.00\",\"yxppfps\":\"0\",\"yxzpje\":\"2509506.00\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201803\",\"jxfps\":\"256\",\"yxzpfps\":\"256\",\"jxje\":\"2519347.20\",\"yxppfps\":\"0\",\"yxzpje\":\"2519347.20\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201802\",\"jxfps\":\"219\",\"yxzpfps\":\"219\",\"jxje\":\"2155222.80\",\"yxppfps\":\"0\",\"yxzpje\":\"2155222.80\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201801\",\"jxfps\":\"256\",\"yxzpfps\":\"256\",\"jxje\":\"2519347.20\",\"yxppfps\":\"0\",\"yxzpje\":\"2519347.20\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201712\",\"jxfps\":\"211\",\"yxzpfps\":\"211\",\"jxje\":\"2076493.20\",\"yxppfps\":\"0\",\"yxzpje\":\"2076493.20\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201711\",\"jxfps\":\"254\",\"yxzpfps\":\"254\",\"jxje\":\"2499664.80\",\"yxppfps\":\"0\",\"yxzpje\":\"2499664.80\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201710\",\"jxfps\":\"241\",\"yxzpfps\":\"241\",\"jxje\":\"2371729.20\",\"yxppfps\":\"0\",\"yxzpje\":\"2371729.20\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201709\",\"jxfps\":\"253\",\"yxzpfps\":\"253\",\"jxje\":\"2489823.60\",\"yxppfps\":\"0\",\"yxzpje\":\"2489823.60\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201708\",\"jxfps\":\"264\",\"yxzpfps\":\"264\",\"jxje\":\"2598076.80\",\"yxppfps\":\"0\",\"yxzpje\":\"2598076.80\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201707\",\"jxfps\":\"258\",\"yxzpfps\":\"258\",\"jxje\":\"2539029.60\",\"yxppfps\":\"0\",\"yxzpje\":\"2539029.60\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201706\",\"jxfps\":\"225\",\"yxzpfps\":\"225\",\"jxje\":\"2214270.00\",\"yxppfps\":\"0\",\"yxzpje\":\"2214270.00\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"201705\",\"jxfps\":\"243\",\"yxzpfps\":\"243\",\"jxje\":\"2391411.60\",\"yxppfps\":\"0\",\"yxzpje\":\"2391411.60\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"2017合计\",\"jxfps\":\"1949\",\"yxzpfps\":\"1949\",\"jxje\":\"19180498.80\",\"yxppfps\":\"0\",\"yxzpje\":\"19180498.80\"},{\"yxppje\":\"0.00\",\"gfkpyf\":\"2018合计\",\"jxfps\":\"1888\",\"yxzpfps\":\"1888\",\"jxje\":\"18580185.60\",\"yxppfps\":\"0\",\"yxzpje\":\"18580185.60\"},{\"yxppje\":\"—\",\"gfkpyf\":\"2019合计\",\"jxfps\":\"—\",\"yxzpfps\":\"—\",\"jxje\":\"—\",\"yxppfps\":\"—\",\"yxzpje\":\"—\"}],\"JBXX\":{\"SCJYDZ\":\"北京市海淀区*****号\",\"DOM\":\"北京市海淀区*****号\",\"REGCAP\":\"59690.0万人民币元\",\"ENTTYPE\":\"有限责任公司\",\"REGORG\":\"北京市质量技术监督局\",\"LEREP\":\"戴珊\",\"UNISCID\":\"91500383L01323701W\",\"REGSTATE\":\"开业\",\"OPSCOPE\":\"开发、销售计算机网络应用软件；设计、制作、加工计算机网络产品并提供相关技术服务和咨询服务；服务：自有物业租赁，翻译，成年人的非证书劳动职业技能培训（涉及许可证的除外）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）\",\"nsrsbh\":\"91500383L01323701W\",\"ybnsrzz\":\"是\",\"REGNO\":\"330100400015575\",\"APPRDATE\":\"2018-07-16\",\"OPTO\":\"2040-09-08\",\"ESTDATE\":\"1999-09-09\",\"OPFROM\":\"1999-09-09\",\"zzjgdm\":\"L01323701\"},\"SFZC\":[],\"EXCEINFO\":[],\"JXFPSLTJ\":[{\"kpyf\":\"201904\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201903\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201902\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201901\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201812\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201811\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201810\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201809\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201808\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201807\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201806\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201805\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201804\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201803\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201802\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201801\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201712\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201711\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201710\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201709\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201708\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201707\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201706\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201705\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"2017合计\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"2018合计\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"2019合计\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"}],\"WDHMD\":[],\"XYDYFB\":[{\"xxje\":\"16779246.00\",\"dqmc\":\"浙江\",\"percent\":\"43.351\"},{\"xxje\":\"15667190.40\",\"dqmc\":\"重庆\",\"percent\":\"40.478\"},{\"xxje\":\"6259003.20\",\"dqmc\":\"内蒙古自治区\",\"percent\":\"16.171\"}],\"SXGG\":[],\"WYZC\":[],\"QSDXYQY\":{\"xyqytj\":{\"xyjnxs\":\"0.27\",\"xyjzd\":\"低\",\"xywdzs\":\"0.53\",\"qysl\":\"10\",\"averageJe\":\"3870543.96\",\"xywdzsName\":\" 交易高度稳定\",\"sumJe\":\"38705439.60\"},\"xysdqy\":[{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-12\",\"fpfs\":\"569\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"756EEF9877FBD02F6ACCC20B9B33D323\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********W\",\"jebl\":\"14.467\",\"dy\":\"重庆市重庆市辖区巴南区\",\"jyje\":\"5599642.80\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"—\",\"zhjyrq\":\"2018-08-15\",\"fpfs\":\"554\",\"djzclx\":\"私营有限责任公司(自然人控股或私营性质企业控股)\",\"zczb\":\"50.0万人民币元\",\"qymc\":\"B21EA7C3F2BAE026A517D6AED71E3EC7\",\"nsxydj\":\"—\",\"hy\":\"金属制品\",\"nsrsbh\":\"3**********8\",\"jebl\":\"14.086\",\"dy\":\"浙江省宁波市余姚市\",\"jyje\":\"5452024.80\",\"zcsj\":\"2012-06-19\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-11\",\"fpfs\":\"547\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"72684D9015805380C0FD9722732BB703\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********Q\",\"jebl\":\"13.908\",\"dy\":\"浙江省宁波市\",\"jyje\":\"5383136.40\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-17\",\"fpfs\":\"536\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"4493A946A06EA1036A41B6783589A3D0\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********X\",\"jebl\":\"13.628\",\"dy\":\"重庆市重庆市辖区綦江区\",\"jyje\":\"5274883.20\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-12\",\"fpfs\":\"520\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"297B8FA8CCC4E3E22715FAAD6B79777C\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********G\",\"jebl\":\"13.221\",\"dy\":\"浙江省宁波市慈溪市\",\"jyje\":\"5117424.00\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-10\",\"fpfs\":\"513\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"A55FC77D9B9DF143B2F2ACA79B8C4311\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********G\",\"jebl\":\"13.043\",\"dy\":\"内蒙古自治区呼和浩特市\",\"jyje\":\"5048535.60\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-11\",\"fpfs\":\"487\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"48466DBE6BB7B04609575073DDC80CE5\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********M\",\"jebl\":\"12.382\",\"dy\":\"重庆市重庆市县\",\"jyje\":\"4792664.40\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-08-05\",\"fpfs\":\"98\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"23AA0C2A08B981211366F857B34CDF89\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********0\",\"jebl\":\"2.492\",\"dy\":\"内蒙古自治区呼和浩特市\",\"jyje\":\"964437.60\",\"zcsj\":\"1999-09-09\"},{\"pjnd\":\"—\",\"zhjyrq\":\"2018-07-30\",\"fpfs\":\"84\",\"djzclx\":\"—\",\"zczb\":\"—\",\"qymc\":\"934895218AE3C822038AC0FF05609929\",\"nsxydj\":\"—\",\"hy\":\"—\",\"nsrsbh\":\"9**********U\",\"jebl\":\"2.136\",\"dy\":\"浙江省宁波市慈溪市\",\"jyje\":\"826660.80\",\"zcsj\":\"—\"},{\"pjnd\":\"2017\",\"zhjyrq\":\"2018-07-01\",\"fpfs\":\"25\",\"djzclx\":\"有限责任公司\",\"zczb\":\"59690.0万人民币元\",\"qymc\":\"23B111D176DF2C3F62C8BBC334B456BB\",\"nsxydj\":\"A\",\"hy\":\"商务服务\",\"nsrsbh\":\"9**********R\",\"jebl\":\"0.636\",\"dy\":\"内蒙古自治区呼和浩特市\",\"jyje\":\"246030.00\",\"zcsj\":\"1999-09-09\"}],\"cjqj\":\"2017年05月-2018年08月\"},\"QYZTXX\":[{\"nsrsbh\":\"91500383L01323701W\",\"nsrmc\":\"爱信诺征信数据演示企业\",\"fpfs\":\"3933\",\"zzkprq\":\"201705\",\"zwkprq\":\"201808\"}],\"KTGG\":[],\"FZJG\":[{\"REGSTATE\":\"存续\",\"REGNO\":\"—\",\"LEREP\":\"余涌\",\"REGORG\":\"—\",\"ESTDATE\":\"2007-10-12\",\"BRNAME\":\"测试企业石家庄分公司\"},{\"REGSTATE\":\"开业\",\"REGNO\":\"—\",\"LEREP\":\"余涌\",\"REGORG\":\"—\",\"ESTDATE\":\"2001-02-20\",\"BRNAME\":\"******北京分公司\"},{\"REGSTATE\":\"存续\",\"REGNO\":\"—\",\"LEREP\":\"余涌\",\"REGORG\":\"—\",\"ESTDATE\":\"2005-10-26\",\"BRNAME\":\"****有限公司上海分公司\"},{\"REGSTATE\":\"存续\",\"REGNO\":\"—\",\"LEREP\":\"余涌\",\"REGORG\":\"—\",\"ESTDATE\":\"2006-06-23\",\"BRNAME\":\"****厦门分公司\"}],\"DFZC\":[],\"ZXGG\":[],\"QYHYPM\":{\"qypm\":\"该企业的销售额在区域排名为前20%\",\"xxje\":\"18698300.00\",\"hypm\":\"—\"},\"CGSPFX\":{\"fpxxVo\":{\"fp_qdxx_sum_rate\":\"100.00\",\"fp_sum\":\"0.00\",\"fp_qdxx_sum\":\"37760684.40\",\"fp_qdxx_count\":\"3837\",\"fp_count\":\"0\",\"fp_sum_rate\":\"0.00\"},\"jzd\":\"不予评价\",\"jx_sl\":\"1\",\"cgsp_jnxs\":\"0.0\",\"jx_spqd\":[{\"xh\":\"3.0\",\"cs\":\"19185\",\"dw\":\"吨\",\"mc\":\"钢材\",\"zb\":\"100.000\",\"je\":\"725730180.00\"}],\"cjqj\":\"2017年05月-2018年08月\"},\"XYHYFB\":[{\"hymc\":\"未知行业\",\"khje\":\"33253414.80\",\"percent\":\"85.914\"},{\"hymc\":\"其他制造业\",\"khje\":\"5452024.80\",\"percent\":\"14.086\"}],\"LEGINFO\":[{\"INV\":\"Alibaba.comChinaLimited\",\"CGBL\":\"100%\",\"LISUBCONAM\":\"59690.000000万美元\",\"BLICNO\":null,\"LIACCONAM\":\"—\",\"CONFORM\":\"—\",\"BLICTYPE\":null,\"INVTYPE\":\"法人股东\"}],\"EQUINFO\":[{\"PLEDGOR\":\"吴峰\",\"IMPAM\":\"2250万人民币元\",\"BLICNO\":\"非公示项\",\"EQUPLEDATE\":\"2017-11-24\",\"IMPORG\":\"安徽创新融资担保有限公司\",\"TYPE\":\"有效\",\"PLEDNO\":\"非公示项\"},{\"PLEDGOR\":\"付彩荣\",\"IMPAM\":\"800万人民币元\",\"BLICNO\":\"非公示项\",\"EQUPLEDATE\":\"2017-11-24\",\"IMPORG\":\"安徽创新融资担保有限公司\",\"TYPE\":\"有效\",\"PLEDNO\":\"非公示项\"}],\"SSQYHY\":{\"hyzlmc\":\"—\",\"cityName\":\"—\",\"provinceName\":\"重庆市\",\"hymx\":\"软件和信息技术服务业\"},\"RLZC\":[],\"SYNLFB\":[{\"zb\":\"100.000\",\"je\":\"37760684.40\",\"nlfb_mc\":\"10年以上\"}],\"XYNLFB\":[{\"zb\":\"83.778\",\"je\":\"32426754.00\",\"nlfb_mc\":\"10年以上\"},{\"zb\":\"14.086\",\"je\":\"5452024.80\",\"nlfb_mc\":\"5-8年\"},{\"zb\":\"2.136\",\"je\":\"826660.80\",\"nlfb_mc\":\"未知\"}],\"FYGG\":[],\"YHZH\":[{\"xxje\":\"38705439.60\",\"yhzh\":\"6084080120110100045036\",\"count\":\"3933\",\"je_rate\":\"100.000\",\"yhmc\":\"建设行股份有限公司\"}],\"XXFPSLTJ\":[{\"kpyf\":\"201904\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201903\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201902\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201901\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201812\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201811\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201810\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201809\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201808\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201807\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201806\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201805\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201804\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201803\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201802\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201801\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201712\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201711\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201710\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201709\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201708\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201707\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201706\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"201705\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"2017合计\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"2018合计\",\"d5\":\"0.00\",\"d6\":\"100.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"},{\"kpyf\":\"2019合计\",\"d5\":\"0.00\",\"d6\":\"0.00\",\"d10\":\"0.00\",\"d11\":\"0.00\",\"d13\":\"0.00\",\"d16\":\"0.00\",\"d17\":\"0.00\",\"dothers\":\"0.00\",\"d0\":\"0.00\",\"d3\":\"0.00\"}],\"IXNZS\":{\"wyzs\":\"718.13\",\"czzs\":\"498.48\"},\"GLOBAL\":{\"IXINNUOBM\":\"284625145557\",\"BGSJ\":\"2017-05-01~2019-05-16\",\"VERSION\":\"V1.3.1\",\"ENTNAME\":\"爱信诺征信数据演示企业\",\"REPORTNAME\":\"爱信诺信用融资审贷报告\",\"JYLSH\":null},\"SYHYFB\":[{\"hymc\":\"未知行业\",\"gysje\":\"37760684.40\",\"percent\":\"100.0\"}],\"WFWZ\":[],\"XXFPSJTJ\":[{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201904\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201903\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201902\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201901\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201812\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201811\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201810\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"201809\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"},{\"yxxxfps\":\"158\",\"xxje\":\"1554909.60\",\"xfkpyf\":\"201808\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"252\",\"xxje\":\"2479982.40\",\"xfkpyf\":\"201807\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"259\",\"xxje\":\"2548870.80\",\"xfkpyf\":\"201806\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"259\",\"xxje\":\"2548870.80\",\"xfkpyf\":\"201805\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"246\",\"xxje\":\"2420935.20\",\"xfkpyf\":\"201804\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"246\",\"xxje\":\"2420935.20\",\"xfkpyf\":\"201803\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"240\",\"xxje\":\"2361888.00\",\"xfkpyf\":\"201802\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"240\",\"xxje\":\"2361888.00\",\"xfkpyf\":\"201801\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"244\",\"xxje\":\"2401252.80\",\"xfkpyf\":\"201712\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"249\",\"xxje\":\"2450458.80\",\"xfkpyf\":\"201711\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"256\",\"xxje\":\"2519347.20\",\"xfkpyf\":\"201710\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"254\",\"xxje\":\"2499664.80\",\"xfkpyf\":\"201709\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"277\",\"xxje\":\"2726012.40\",\"xfkpyf\":\"201708\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"262\",\"xxje\":\"2578394.40\",\"xfkpyf\":\"201707\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"232\",\"xxje\":\"2283158.40\",\"xfkpyf\":\"201706\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"259\",\"xxje\":\"2548870.80\",\"xfkpyf\":\"201705\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"2033\",\"xxje\":\"20007159.60\",\"xfkpyf\":\"2017合计\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"1900\",\"xxje\":\"18698280.00\",\"xfkpyf\":\"2018合计\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"0\",\"zffpje\":\"0.00\"},{\"yxxxfps\":\"—\",\"xxje\":\"—\",\"xfkpyf\":\"2019合计\",\"fs_xx_yxfps\":\"—\",\"xx_hc\":\"—\",\"zffps\":\"—\",\"zffpje\":\"—\"}],\"YSJCC\":[],\"SPFLFX\":{\"spfl_fpfs\":\"0\",\"spfl_jerate\":\"0.00\",\"unspfl_jerate\":\"100.00\",\"spflList\":[],\"qdmx_fpfs\":\"3933\",\"spfl_je\":\"0.00\",\"unspfl_je\":\"38705439.60\",\"unspfl_fpfs\":\"3933\"},\"SYDYFB\":[{\"jxje\":\"20666520.00\",\"dqmc\":\"重庆\",\"percent\":\"54.73\"},{\"jxje\":\"11002461.60\",\"dqmc\":\"浙江\",\"percent\":\"29.137\"},{\"jxje\":\"6091702.80\",\"dqmc\":\"内蒙古自治区\",\"percent\":\"16.132\"}],\"QyxxHz\":{\"zz_kprq\":\"2016-01-02\",\"jshj_24\":\"45584438.40\"},\"MORTINFO\":[],\"lxrList\":[],\"QDXX\":{\"kpjList\":[{\"kpxe\":\"—\",\"kpjh\":\"661725570594\",\"zfjh\":\"主\",\"qdcsSum\":\"1\",\"bgcsSum\":\"0\",\"fxsj\":\"—\",\"qdxxList\":[{\"cs\":\"1\",\"ip\":\"180.107.196.81\",\"latitude\":\"31.31798737\",\"zzqdrq\":\"2019-01-21 09:03:50\",\"dqmc\":\"重庆市\",\"mac\":\"92-66-e1-e6-48-df\",\"zwqdrq\":\"2019-01-21 09:03:50\",\"longitude\":\"120.61990712\"}],\"rzsj\":\"2019-01-21\",\"sblx\":\"金税盘\"}],\"kpj_count\":\"—\",\"kpjlx\":\"金税盘\",\"fp_kpj_count\":\"1\"},\"PUNINFO\":[],\"PERINFO\":[{\"POSITION\":\"监事\",\"NAME\":\"冯云乐\"},{\"POSITION\":\"董事\",\"NAME\":\"蒋芳\"},{\"POSITION\":\"董事长兼总经理\",\"NAME\":\"戴珊\"},{\"POSITION\":\"董事\",\"NAME\":\"张彧\"}],\"XYLXFB\":[{\"qylx_mc\":\"有限责任公司\",\"zb\":\"83.778\",\"je\":\"32426754.00\"},{\"qylx_mc\":\"私营有限责任公司(自然人控股或私营性质企业控股)\",\"zb\":\"14.086\",\"je\":\"5452024.80\"},{\"qylx_mc\":\"未知\",\"zb\":\"2.136\",\"je\":\"826660.80\"}],\"FZCHXX\":[],\"AJLC\":[]}}";
        Map<String,String > map = new HashMap();
        String etlDate ="201905000";
        // writeData12(data,map,etlDate);
        toUpper(data);
    }
    public void writeData(  String urlData , Map<String, String> afeMap,  String etlDate) {
        try {
            SSD1_FirstVo firstVo = new Gson().fromJson(urlData, SSD1_FirstVo.class);
            // SSD1_FirstVo firstVo =(SSD1_FirstVo)JSONObject.toBean(urlData, SSD1_FirstVo.class);
            // SSD1_FirstVo firstVo =JSON.parseObject(urlData, new TypeReference<SSD1_FirstVo>() {});

            // 状态正常，并有数据
            if ("0".equals(firstVo.getCode() )) {
                SSD1_SecondVo content =  firstVo.getContent();
                content.setWriteFlag(false);
                //                Field[] contents = content.getClass().getDeclaredFields();
                //                for(int j=0;j<contents.length;j++){
                //
                //                    String fieldName = contents[j].getName();
                //                    fieldName = fieldName.replaceFirst(fieldName.substring(0, 1), fieldName.substring(0, 1).toUpperCase());// 属性首字母大写
                //                    Method method = content.getClass().getMethod("get" + fieldName);
                //                    Object object = method.invoke(content);
                //
                //                    if(object instanceof List){
                //                       writeListToFile((List)object,  afeMap,etlDate);
                //                    }else{
                //                        writeObjectToFile(object,  afeMap,etlDate);
                //                    }
                //
                writeObjectToFile(content,  afeMap,etlDate);
                //                }

            } /*else {
				// 状态不正常
				FileHttpClientUtils.writeNotFoundFile(notFoundFileName, decURLData + "|+|" + url + "|+|", currentEntName, afeMap);
				HttpClientConstants.LOG.info(HttpClientConstants.LOG_PREFIX + " writeData , decURLData:" + decURLData + "，url: " + url);
			}*/
        } catch (Exception e) {
            e.printStackTrace();
            //			String writeData = decURLData == null ? "null" : decURLData;
            //			FileHttpClientUtils.writeNotFoundFile(notFoundFileName, writeData + "|+|" + url + "|+|", currentEntName, afeMap);
            //			/*
            //			 * HttpClientConstants.LOG.error(HttpClientConstants.LOG_PREFIX + " writeData,Exception decURLData:" + decURLData + "，url: " + url,e);
            //			 */
        }
    }

    private <T> void writeListToFile(List<T> listData, Map<String, String> afeMap, String etlDate){
        if(!CollectionUtils.isEmpty(listData)){
            StringBuilder stringBuilder = new StringBuilder();

            String className="";
            for(Object o :listData){
                //赋值 5个值 todo


                className = o.getClass().getName();
                stringBuilder.append(o.toString()).append("|+|\n");

                try {
                    Field[] field = o.getClass().getDeclaredFields();
                    for (int i = 0; i < field.length; i++) {
                        //字段属性为list
                        String name = field[i].getName();
                        name = name.replaceFirst(name.substring(0, 1), name.substring(0, 1).toUpperCase());// 属性首字母大写
                        Method m = o.getClass().getMethod("get" + name);
                        String type = field[i].getGenericType().toString(); // 获取属性的类型
                        //		       	if(field[i].getType().equals(List.class)){
                        //                    if(type.equals("class java.util.List")){
                        if(type.contains("java.util.List")){
                            //todo 可能里面还包含list
                            List list = (List)m.invoke(o);
                            writeListToFile(list,afeMap,etlDate);
                        }else if(!type.equals("class java.lang.String")){
                            Object object = m.invoke(o);
                            writeObjectToFile(object,afeMap,etlDate);
                        }
                    }
                } catch (Exception e) {
                    // TODO Auto-generated catch block
                    e.printStackTrace();
                }
            }
            //		String data = stringBuilder.toString().substring(0,stringBuilder.toString().length()-2);
            String data = stringBuilder.toString();
            String tableName = className.split("\\.")[ className.split("\\.").length-1].toLowerCase();
            //String etlDate = getFormatDate(getDiffDate(new Date(), 0));
            //文件名 "i_edmp_ssd1_report_20190426.dat"
            String fileName = "i_edmp_"+tableName+"_"+etlDate+".dat";
            // 路径"/edmp/receive/{$predate}/bdap/ssd1"
            String path = "D:/edmp/receive/"+etlDate+"/bdap/ssd1";
            writeFile(data,fileName,path);
        }

    }
    private void writeObjectToFile(Object object, Map<String, String> afeMap, String etlDate){
        if (ObjectUtils.allNotNull()) {
            //            if(object.isWriteFlag()){
            StringBuilder stringBuilder = new StringBuilder();
            //赋值 5个值 todo


            String data = stringBuilder.append(object.toString()).append("|+|\n").toString();
            String className = object.getClass().getName();
            String tableName = className.split("\\.")[ className.split("\\.").length-1].toLowerCase();
            //文件名 "i_edmp_ssd1_report_20190426.dat"
            String fileName = "i_edmp_"+tableName+"_"+etlDate+".dat";
            // 路径"/edmp/receive/{$predate}/bdap/ssd1"
            String path = "D:/edmp/receive/"+etlDate+"/bdap/ssd1";
            //写dat文件 todo
            writeFile(data,fileName,path);
            //            }

            try {
                Field[] field = object.getClass().getDeclaredFields();
                for (int i = 0; i < field.length; i++) {
                    //字段属性为list
                    String name = field[i].getName();
                    name = name.replaceFirst(name.substring(0, 1), name.substring(0, 1).toUpperCase());// 属性首字母大写
                    Method m = object.getClass().getMethod("get" + name);
                    String type = field[i].getGenericType().toString(); // 获取属性的类型
                    //	        if(field[i].getType().equals(List.class)){
                    //                if(type.equals("class java.util.List")){
                    if(type.contains("java.util.List")){
                        //todo 可能里面还包含list
                        List list = (List)m.invoke(object);
                        writeListToFile(list,afeMap,etlDate);
                    }else if(!type.equals("class java.lang.String")){
                        Object o = m.invoke(object);
                        writeObjectToFile(o,afeMap,etlDate);
                    }
                }
            } catch (Exception e) {
                // TODO Auto-generated catch block
                e.printStackTrace();
            }
        }

    }
    private void writeFile(String data,String fileName,String path){
        BufferedWriter bufferedWriter = null;
        File f = new File(path);
        if (!f.exists()) {
            f.mkdirs();
        }
        try {
            File file = new File(path+"/"+fileName);
            if (!file.exists())
                file.createNewFile();
            //            bufferedWriter = new BufferedWriter(new OutputStreamWriter(new FileOutputStream(file, true),
            //                    HttpClientGlobalConfig.appConfig.getSecretKeyCharsetName()));
            bufferedWriter = new BufferedWriter(new OutputStreamWriter(new FileOutputStream(file, true),
                    "UTF-8"));
            bufferedWriter.write(data);
        } catch (Exception e) {
            // TODO Auto-generated catch block
            e.printStackTrace();
        }finally {
            try {
                if (bufferedWriter != null) {
                    bufferedWriter.close();
                }
            } catch (IOException e) {
                //                LOG.info(HttpClientConstants.LOG_PREFIX + "  writeFile,  IOException", e);
                e.printStackTrace();
            }

        }
    }

//    @Test
//    public void testFatherAndSon(){
//        Person person = new Person();
//        System.out.println(person.isFlag());
//        System.out.println("+++++++++++++++++++++++++++++++++++++");
//        Student student = new Student();
//        System.out.println(student.isFlag());
//
//
//    }
    @Test
    public void testListToString(){
        List<Short> stringCollection = new ArrayList<>();
        stringCollection.add((short) 4);
        stringCollection.add((short) 4);
        stringCollection.add((short) 4); stringCollection.add((short) 4);

        String listString = stringCollection.toString().substring(1,stringCollection.toString().length()-1);
        System.out.println(listString);
//        stringCollection.add("aaa2");
//        stringCollection.add("bbb1");
//        stringCollection.add("aaa1");
//        stringCollection.add("bbb3");
//        stringCollection.add("ccc");
//        stringCollection.add("bbb2");
//        stringCollection.add("ddd1");
        System.out.println(stringCollection);

    }

    @Test
    public void testCreateFile(){

        String file_path = "D:/test/test.txt";
        boolean bo = false;
        File myFilePath = new File(file_path);
        System.out.println(myFilePath.getParent());
        System.out.println(myFilePath.getParentFile());
        System.out.println(myFilePath.getPath());
        System.out.println(myFilePath.getAbsolutePath());
        // System.out.println(myFilePath.getCanonicalPath());
        try {
            if (!myFilePath.exists()) {
                if (!myFilePath.getParentFile().exists()) {
                    myFilePath.getParentFile().mkdirs();
                }
                myFilePath.createNewFile();
            }
            bo = true;
        } catch (Exception e) {
            e.printStackTrace();
        }


    }
    @Test
    public void testTryCatch(){


        try {
            int i = 1/0;

        } catch (Exception e) {
            e.printStackTrace();
        }finally {

        }

        System.out.println("================");
        Predicate<String> predicate = String::isEmpty;
        System.out.println(predicate.test(""));;
    }

    @Test
    public  void roleJsonParseToObj(){
        String data ="{\"errNum\":0,\"errMsg\":\"success\",\"timeStamps\":1557373683027,"
                + "\"retData\":{\"top10sp_ratio_in3month\":\"19.260399626236136\",\"sptype_count_in6month\":\"1\","
                + "\"cus_incr_new6\":\"0\",\"cus_incr_new3\":\"0\",\"yzxzs\":\"0.759621942583937\","
                + "\"nearlynmons_ent_amount_aratio12\":\"0.8908498506652286\",\"cus_loss_ratio6\":\"1.0\","
                + "\"top1sp_ratio_in3month\":\"19.260399626236136\",\"cus_loss_ratio3\":\"1.0\",\"cus_person_times3\":\"0\","
                + "\"cus_person_times6\":\"0\",\"nearlynmons_ent_amount_aratio3\":\"0.8831725616291506\","
                + "\"nearlynmons_ent_newincr_aratio3\":\"0.0\",\"nearlynmons_ent_newincr_aratio6\":\"0.0\","
                + "\"qy_credit_change\":\"下滑\",\"cus_person_times12\":\"0\",\"nearlynmons_ent_amount_aratio6\":\"0"
                + ".89592274678112\",\"top3sp_ratio_in6month\":\"19.239822370662406\",\"cus_yoy_incr_kh6\":\"0.0\","
                + "\"top3sp_ratio_in3month\":\"19.260399626236136\",\"nearlynmons_ent_aratio6\":\"0.9230769230769231\","
                + "\"cus_trade_active_ratio6\":\"5.6923076923076925\",\"nearlynmons_ent_aratio3\":\"0.9230769230769231\","
                + "\"cus_trade_active_ratio3\":\"2.8461538461538463\",\"nearlynmons_ent_newincr_aratio12\":\"0.0\","
                + "\"cus_yoy_incr_kh3\":\"0.0\",\"sptype_count_in12month\":\"1\",\"top10sp_ratio_in6month\":\"19"
                + ".239822370662406\",\"old_customer_ratio6\":\"1.0\",\"old_customer_ratio3\":\"1.0\","
                + "\"nearlynmons_ent_aratio12\":\"0.9230769230769231\",\"qy_credit_last2year\":\"A\","
                + "\"qy_credit_lastyear\":\"\",\"consistency_dq\":\"0.23076923076923078\",\"consistency_hy\":\"0.0\","
                + "\"cus_trade_active_ratio12\":\"11.538461538461538\",\"top1sp_ratio_in6month\":\"19.239822370662406\","
                + "\"sptype_count_in3month\":\"1\",\"top10sp_overlapratio_in3month_lastyear\":\"1.0\","
                + "\"top10sp_overlapratio_in6month\":\"1.0\",\"grkhfpzb\":\"0.0\",\"top10sp_overlapratio_in3month\":\"1.0\","
                + "\"hhi\":\"0.8639695900081458\",\"count_customer_downstream12\":\"13\",\"old_customer_ratio12\":\"1.0\","
                + "\"zdkpjg\":\"2.0\",\"cus_yoy_incr_people6\":\"-1.0\",\"cus_yoy_incr_kh12\":\"0.0\","
                + "\"cus_loss_ratio12\":\"1.0\",\"cus_yoy_incr_people3\":\"-1.0\",\"count_customer_downstream3\":\"13\","
                + "\"count_customer_downstream6\":\"13\"}}";
        Map<String,String > map = new HashMap();
        String etlDate ="201905161";
        // writeData12(data,map,etlDate);
        toUpper(data);

    }

    private void writeData12(String data, Map<String, String> map, String etlDate) {
        try {
            Map map1 = new Gson().fromJson(data,Map.class);
            Map map2 = mapToUpper(map1);
            //            Function<String,String> function = (s)->{
            //                Map map1 = new Gson().fromJson(data,Map.class);
            //                Map map2 = mapToUpper(map1);
            //
            //                return s;
            //            };
            String json = new Gson().toJson(map2);
            System.out.println(json);

        } catch (Exception e) {
            e.printStackTrace();
        }
    }
    private String toUpper(String data) {
        Map map1 = new Gson().fromJson(data,Map.class);
        Map map = new HashMap();

        for(Object o : map1.keySet()){
            map.put(((String) o).toUpperCase(),map1.get(o));
            if(map1.get(o) instanceof java.lang.String){
                map.put(((String) o).toUpperCase(),map1.get(o));
            }else if(map1.get(o) instanceof java.util.List){

                List list  = new ArrayList();
                for(Object o1  : (List)map1.get(o)){
                    if(o1 instanceof java.util.Map){
                        Map map2 = mapToUpper((Map)o1);
                        list.add(map2);

                    }
                }
                map.put(((String) o).toUpperCase(),list);
            }else if(map1.get(o) instanceof java.util.Map){
                Map map2 = mapToUpper((Map)map1.get(o));
                map.put(((String) o).toUpperCase(),map2);
            }
        }
        String json = new Gson().toJson(map);
        System.out.println(json);
        return json;

    }
    private Map mapToUpper(Map map1) {
        Map map = new HashMap();

        for(Object o : map1.keySet()){
            map.put(((String) o).toUpperCase(),map1.get(o));
            if(map1.get(o) instanceof java.lang.String){
                map.put(((String) o).toUpperCase(),map1.get(o));
            }else if(map1.get(o) instanceof java.util.List){

                List list  = new ArrayList();
                for(Object o1  : (List)map1.get(o)){
                    if(o1 instanceof java.util.Map){
                        Map map2 = mapToUpper((Map)o1);
                        list.add(map2);
                    }

                }


                map.put(((String) o).toUpperCase(),list);
            }else if(map1.get(o) instanceof java.util.Map){
                Map map2 = mapToUpper((Map)map1.get(o));
                map.put(((String) o).toUpperCase(),map2);
            }
        }
        return map;

    }

    private void writeData11(String data, Map<String, String> map, String etlDate) {
        try {


            com.google.gson.JsonParser  jsonParser = new  com.google.gson.JsonParser();
            com.google.gson.JsonElement jsonElement = jsonParser.parse(data);

            if(jsonElement.isJsonObject()){
                JsonElement jsonE = jsonObjecttoUpper(jsonElement.getAsJsonObject());
                System.out.println("=================");
            }else if(jsonElement.isJsonArray()){
                JsonElement jsonE = jsonArrToUpper(jsonElement.getAsJsonArray());
            }




        } catch (Exception e) {
            e.printStackTrace();
        }
    }

    private JsonElement jsonArrToUpper(JsonArray asJsonArray) {
        JsonElement jsonElement = new JsonElement() {
            @Override
            public JsonElement deepCopy() {
                for (JsonElement jsonElement : asJsonArray) {

                }
                return null;
            }
        };

        return null;
    }

    private com.google.gson.JsonElement jsonObjecttoUpper(com.google.gson.JsonObject js){
        final com.google.gson.JsonObject jsonObject = js;
        JsonElement  jsonE = new JsonElement() {
            private LinkedTreeMap<String, JsonElement> members =
                    new LinkedTreeMap<String, JsonElement>();
            @Override
            public JsonElement deepCopy() {
                com.google.gson.JsonObject object = new  com.google.gson.JsonObject();
                for(Map.Entry<String, JsonElement> entry : jsonObject.entrySet()){
                    members.put(entry.getKey().toUpperCase(),entry.getValue());
                }

                return object;
            }
        };
        return jsonE;
    }

    @Test
    public void testWei(){
        int i = -10;
        System.out.println(1 == (1&i));
    }


    @Test
    public void testMap(){
        Map map = new HashMap();
        map.put("aaa","aaa");
        map.put("bbb","bbb");
        System.out.println(map);
        System.out.println("_+_+_+_+_+_+=-=-=-=-=-=-=-=-=-=-=_+_+_+_+_+_+_+_+_+_+_+_");
        Map map1 = map;
        map1.put("aaa","111");
        System.out.println(map);

    }

    /**
     * yaml 文件映射成实体对象
     * @throws Exception
     */
    @Test
    public void testYaml ()throws Exception{

        // 利用Yaml实现
        Yaml yaml = new Yaml();
        InputStream stream = MyTest.class.getClassLoader().getResourceAsStream("demo2.yaml");
        HashMap hashMap = yaml.loadAs(stream, HashMap.class);
        System.out.println(hashMap);
        System.out.println("_+_+_+_+_+_+_+_+_+++_");
        HashMap map2  = (HashMap)hashMap.get("demo");
        Object o  =  new Gson().fromJson(new Gson().toJson(map2),Map.class);
        System.out.println(o);


        // 利用YamlReader实现
        ClassLoader classLoader = getClass().getClassLoader();
        // .substring 的原因是路径前面多了一个/
        String path = classLoader.getResource("demo.yaml").getPath().substring(1);
        System.out.println(path);

        //路径中有乱码问题处理
        path = java.net.URLDecoder.decode(path,"utf-8");
        System.out.println(path);
        //  YamlReader reader = new YamlReader(new FileReader("D:/demo.yaml"));
        YamlReader reader = new YamlReader(new FileReader(path));
        Demo demo = reader.read(Demo.class);
        System.out.println(demo);


    }


}
